src/cfe/МенеджерСинхронизаций/Catalogs/МС_НастройкиПодключений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>МС_НастройкиПодключений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПодключения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МС_ВидыПодключений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьSSL</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПрокси</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроксиСервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроксиПорт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроксиПользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПассивныйРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньЗащищенногоСоединенияFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойКаталогFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заголовки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяЗаголовка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/Enums/МС_ВидыПодключений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>МС_ВидыПодключений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTTP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FTP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольноеПодключение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/Catalogs/МС_НастройкиПодключений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает готовое соединение с внешним источником для указанной настройки подключения.
// Тип возвращаемого объекта в поле Соединение зависит от вида подключения:
//   - HTTP -> HTTPСоединение
//   - FTP -> FTPСоединение
//   - ПроизвольноеПодключение -> любой объект, который присвоит переменной Соединение
//                                выражение из реквизита КодПодключения (legacy).
//
// Имя функции сохранено ради обратной совместимости: она уже вызывается из
// МС_ОбщегоНазначенияСервер, Catalogs.МС_ЗапросыКВнешнимИсточникам.ManagerModule и
// формы элемента справочника. Переименование сломало бы существующие вызовы.
//
// Параметры:
//   НастройкаПодключенияСсылка - СправочникСсылка.МС_НастройкиПодключений
//
// Возвращаемое значение:
//   Структура - см. НовоеСоединение.
//
Функция ПолучитьСоединение(НастройкаПодключенияСсылка) Экспорт

	Настройка = ПрочитатьНастройкуПодключения(НастройкаПодключенияСсылка);
	
	Если Настройка.ВидПодключения = Перечисления.МС_ВидыПодключений.HTTP Тогда
		Возврат НовоеСоединениеHTTP(Настройка);
	ИначеЕсли Настройка.ВидПодключения = Перечисления.МС_ВидыПодключений.FTP Тогда
		Возврат НовоеСоединениеFTP(Настройка);
	Иначе
		Возврат ПолучитьСоединениеПроизвольное(Настройка);
	КонецЕсли;

КонецФункции

// Конструктор пустой структуры-результата установления соединения.
// Используется как эталон формы возвращаемого значения для ПолучитьСоединение.
//
// Возвращаемое значение:
//   Структура:
//     * Соединение - HTTPСоединение, FTPСоединение, Произвольный, Неопределено - объект соединения.
//     * Заголовки - Соответствие из КлючИЗначение:
//         ** Ключ - Строка - имя HTTP-заголовка;
//         ** Значение - Строка - значение заголовка.
//         Используется только для HTTP; для FTP - пустое соответствие.
//     * СтрокаОшибок - Строка - текст ошибки, пустая строка при успехе.
//     * БазовыйПуть - Строка - для HTTP: путь из поля Сервер без завершающего "/", например
//         "/rabbitmq/api" для https://example.com/rabbitmq/api. Пустая строка, если пути нет.
//         ВыполнитьHTTPЗапрос его сам не подставляет: ресурс собирает вызывающий код.
//     * ОсновнойКаталогFTP - Строка - для FTP: каталог, от которого отсчитываются пути файлов, вида "/lkr-data"
//         (с начальным "/", без завершающего). Пустая строка - пути используются как есть, см. ПолныйПутьFTP.
//
Функция НовоеСоединение() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Соединение", Неопределено);
	Результат.Вставить("Заголовки", Новый Соответствие);
	Результат.Вставить("СтрокаОшибок", "");
	Результат.Вставить("БазовыйПуть", "");
	Результат.Вставить("ОсновнойКаталогFTP", "");
	Возврат Результат;

КонецФункции

// Проверяет подключение обращением к серверу.
// Создание HTTPСоединение само по себе в сеть не ходит, поэтому для HTTP выполняется
// GET на путь из реквизита Сервер (или "/") с переходом по перенаправлениям,
// для FTP - запрос текущего каталога.
// Для вида ПроизвольноеПодключение проверяется только выполнение КодПодключения.
//
// Параметры:
//   НастройкаПодключенияСсылка - СправочникСсылка.МС_НастройкиПодключений
//
// Возвращаемое значение:
//   Структура:
//     * Успешно - Булево - сервер ответил: HTTP-код 2xx после перенаправлений или FTP-команда выполнена.
//     * Текст - Строка - результат проверки для показа пользователю.
//
Функция ПроверитьСоединение(НастройкаПодключенияСсылка) Экспорт

	Результат = Новый Структура("Успешно, Текст", Ложь, "");

	Настройка = ПрочитатьНастройкуПодключения(НастройкаПодключенияСсылка);
	СтруктураСоединения = ПолучитьСоединение(НастройкаПодключенияСсылка);

	Если ЗначениеЗаполнено(СтруктураСоединения.СтрокаОшибок) Или СтруктураСоединения.Соединение = Неопределено Тогда
		Результат.Текст = "Не удалось создать соединение: " + СтруктураСоединения.СтрокаОшибок;
		Возврат Результат;
	КонецЕсли;

	Если Настройка.ВидПодключения = Перечисления.МС_ВидыПодключений.HTTP Тогда
		ПроверитьСоединениеHTTP(Настройка, СтруктураСоединения, Результат);
	ИначеЕсли Настройка.ВидПодключения = Перечисления.МС_ВидыПодключений.FTP Тогда
		ПроверитьСоединениеFTP(СтруктураСоединения, Результат);
	Иначе
		Результат.Успешно = Истина;
		Результат.Текст = "Код подключения выполнен без ошибок. Обращение к серверу не проверялось.";
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Полный путь файла на FTP с учетом основного каталога настройки подключения.
//
// Параметры:
//   ОсновнойКаталогFTP - Строка - см. НовоеСоединение.ОсновнойКаталогFTP.
//   Путь - Строка - путь файла от основного каталога, например "/2026/01/file.pdf".
//
// Возвращаемое значение:
//   Строка - например "/lkr-data/2026/01/file.pdf"; Путь без изменений, если основной каталог не задан.
//
Функция ПолныйПутьFTP(ОсновнойКаталогFTP, Путь) Экспорт

	Если Не ЗначениеЗаполнено(ОсновнойКаталогFTP) Тогда
		Возврат Путь;
	КонецЕсли;
	Возврат ОсновнойКаталогFTP + "/" + ?(СтрНачинаетсяС(Путь, "/"), Сред(Путь, 2), Путь);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Начало тела ответа для текста проверки: по нему видно, кто ответил (приложение или прокси перед ним).
//
// Параметры:
//   ТелоТекст - Строка - тело ответа.
//
// Возвращаемое значение:
//   Строка - " Ответ сервера: <до 300 символов тела>" или пустая строка, если тела нет.
//
Функция ФрагментОтвета(ТелоТекст)

	Текст = СокрЛП(ТелоТекст);
	Если Не ЗначениеЗаполнено(Текст) Тогда
		Возврат "";
	КонецЕсли;
	Возврат " Ответ сервера: " + Лев(Текст, 300);

КонецФункции

// Выполняет GET на путь из адреса сервера и оценивает код ответа.
// Перенаправления выполняет МС_ПодключенияСервер.ВыполнитьHTTPЗапрос, оценивается ответ
// последнего сервера в цепочке.
//
// Параметры:
//   Настройка - см. ПрочитатьНастройкуПодключения.
//   СтруктураСоединения - см. НовоеСоединение.
//   Результат - см. ПроверитьСоединение.
//
Процедура ПроверитьСоединениеHTTP(Настройка, СтруктураСоединения, Результат)

	Ресурс = ПутьИзАдресаHTTP(Настройка.Сервер);
	Ответ = МС_ПодключенияСервер.ВыполнитьHTTPЗапрос(СтруктураСоединения, "GET", Ресурс);
	Адрес = Ответ.ИтоговыйАдрес;
	БылиПеренаправления = (Ответ.ЦепочкаАдресов.Количество() > 1);

	КодОтвета = Ответ.КодСостояния;
	Если ЗначениеЗаполнено(Ответ.СтрокаОшибок) Тогда
		Результат.Текст = "Сервер " + Адрес + " недоступен: " + Ответ.СтрокаОшибок;
	ИначеЕсли КодОтвета >= 200 И КодОтвета < 300 Тогда
		Результат.Успешно = Истина;
		Результат.Текст = "Соединение установлено: GET " + Адрес + " вернул код " + КодОтвета + ".";
	ИначеЕсли КодОтвета >= 300 И КодОтвета < 400 Тогда
		Результат.Текст = "Сервер " + Адрес + " вернул перенаправление (код " + КодОтвета
			+ "), которое не удалось выполнить: нет заголовка Location или превышено число перенаправлений ("
			+ МС_ПодключенияСервер.МаксимумПеренаправлений() + ").";
	ИначеЕсли КодОтвета = 401 Или КодОтвета = 403 Тогда
		Результат.Текст = "Сервер " + Адрес + " доступен, но отклонил авторизацию (код " + КодОтвета
			+ "). Проверьте пользователя, пароль и заголовки.";
		Если БылиПеренаправления Тогда
			Результат.Текст = Результат.Текст + " При перенаправлении на другой сервер логин, пароль"
				+ " и заголовки Authorization, Cookie не передаются: укажите в поле ""Сервер"" конечный адрес.";
		КонецЕсли;
	ИначеЕсли КодОтвета = 404 И СтрНайти(Ответ.ТелоТекст, "Object Not Found") > 0 Тогда
		// RabbitMQ Management API отвечает так на путь без метода, в том числе на корень API.
		Результат.Успешно = Истина;
		Результат.Текст = "Сервер " + Адрес + " доступен, ответил RabbitMQ Management API (код 404 ""Object Not Found""):"
			+ " у корня API нет метода, это ожидаемый ответ. Логин и пароль этой проверкой не проверяются,"
			+ " чтение очереди проверяется выполнением запроса приема.";
	Иначе
		Результат.Текст = "Сервер " + Адрес + " доступен, но вернул код " + КодОтвета
			+ ". Проверьте путь в адресе сервера." + ФрагментОтвета(Ответ.ТелоТекст);
	КонецЕсли;

	Если БылиПеренаправления Тогда
		Результат.Текст = Результат.Текст + Символы.ПС + "Перенаправления: "
			+ СтрСоединить(Ответ.ЦепочкаАдресов, " -> ") + "."
			+ " Каждый запрос по этой настройке проходит через перенаправление,"
			+ " лучше указать в поле ""Сервер"" конечный адрес.";
	КонецЕсли;

КонецПроцедуры

// Запрашивает текущий каталог FTP-сервера.
//
// Параметры:
//   СтруктураСоединения - см. НовоеСоединение.
//   Результат - см. ПроверитьСоединение.
//
Процедура ПроверитьСоединениеFTP(СтруктураСоединения, Результат)

	Попытка
		ТекущийКаталог = СтруктураСоединения.Соединение.ТекущийКаталог();
	Исключение
		Результат.Текст = "FTP-сервер не ответил: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат;
	КонецПопытки;

	Результат.Успешно = Истина;
	Результат.Текст = "Соединение установлено, текущий каталог FTP: " + ТекущийКаталог;

	ОсновнойКаталог = СтруктураСоединения.ОсновнойКаталогFTP;
	Если Не ЗначениеЗаполнено(ОсновнойКаталог) Тогда
		Возврат;
	КонецЕсли;
	Попытка
		Содержимое = СтруктураСоединения.Соединение.НайтиФайлы(ОсновнойКаталог, "*");
		Результат.Текст = Результат.Текст + ". Основной каталог " + ОсновнойКаталог + " доступен, файлов и каталогов в нем: "
			+ Содержимое.Количество() + ".";
	Исключение
		Результат.Успешно = Ложь;
		Результат.Текст = Результат.Текст + ". Основной каталог " + ОсновнойКаталог
			+ " не найден или к нему нет доступа: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

КонецПроцедуры

// Приводит основной каталог FTP к виду "/каталог": с начальным "/", без завершающего, без пробелов по краям.
//
// Параметры:
//   Каталог - Строка - значение реквизита ОсновнойКаталогFTP.
//
// Возвращаемое значение:
//   Строка - каталог; пустая строка, если каталог не задан или это корень "/".
//
Функция НормализованныйКаталогFTP(Каталог)

	Значение = СокрЛП(Каталог);
	Пока СтрЗаканчиваетсяНа(Значение, "/") Цикл
		Значение = Лев(Значение, СтрДлина(Значение) - 1);
	КонецЦикла;
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат "";
	КонецЕсли;
	Возврат ?(СтрНачинаетсяС(Значение, "/"), Значение, "/" + Значение);

КонецФункции

// Возвращает путь из адреса HTTP-сервера (часть после хоста и порта).
// Например, для "https://example.com/rabbitmq/" вернет "/rabbitmq/".
//
// Параметры:
//   Адрес - Строка - значение реквизита Сервер.
//
// Возвращаемое значение:
//   Строка - путь, начинающийся с "/"; "/" если путь в адресе не указан.
//
Функция ПутьИзАдресаHTTP(Адрес)

	Значение = ОчиститьСхемуИзАдреса(Адрес);
	ПозицияСлеша = СтрНайти(Значение, "/");
	Если ПозицияСлеша = 0 Тогда
		Возврат "/";
	КонецЕсли;
	Возврат Сред(Значение, ПозицияСлеша);

КонецФункции

// Читает настройку подключения из базы вместе с секретами из безопасного хранилища.
//
// Параметры:
//   НастройкаПодключенияСсылка - СправочникСсылка.МС_НастройкиПодключений
//
// Возвращаемое значение:
//   Структура - все реквизиты справочника плюс:
//     * Ссылка - СправочникСсылка.МС_НастройкиПодключений;
//     * Пароль - Строка - расшифрованный пароль основного пользователя;
//     * ПроксиПароль - Строка - расшифрованный пароль прокси-пользователя;
//     * Заголовки - Массив из Структура:
//         ** ИмяЗаголовка - Строка;
//         ** Значение - Строка.
//
Функция ПрочитатьНастройкуПодключения(НастройкаПодключенияСсылка)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Настройки.Ссылка КАК Ссылка,
	|	Настройки.ВидПодключения КАК ВидПодключения,
	|	Настройки.Сервер КАК Сервер,
	|	Настройки.Порт КАК Порт,
	|	Настройки.ИспользоватьSSL КАК ИспользоватьSSL,
	|	Настройки.Таймаут КАК Таймаут,
	|	Настройки.Пользователь КАК Пользователь,
	|	Настройки.ИспользоватьПрокси КАК ИспользоватьПрокси,
	|	Настройки.ПроксиСервер КАК ПроксиСервер,
	|	Настройки.ПроксиПорт КАК ПроксиПорт,
	|	Настройки.ПроксиПользователь КАК ПроксиПользователь,
	|	Настройки.ПассивныйРежим КАК ПассивныйРежим,
	|	Настройки.УровеньЗащищенногоСоединенияFTP КАК УровеньЗащищенногоСоединенияFTP,
	|	Настройки.ОсновнойКаталогFTP КАК ОсновнойКаталогFTP,
	|	Настройки.СтрокаПодключения КАК СтрокаПодключения,
	|	Настройки.КодПодключения КАК КодПодключения
	|ИЗ
	|	Справочник.МС_НастройкиПодключений КАК Настройки
	|ГДЕ
	|	Настройки.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", НастройкаПодключенияСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Настройка = Новый Структура;

	Если Выборка.Следующий() Тогда
		Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
			Настройка.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
		КонецЦикла;
	Иначе
		Настройка.Вставить("Ссылка", НастройкаПодключенияСсылка);
		Настройка.Вставить("ВидПодключения", Неопределено);
	КонецЕсли;

	// Заголовки табличной части читаем отдельным запросом
	Заголовки = Новый Массив;
	ЗапросЗаголовки = Новый Запрос;
	ЗапросЗаголовки.Текст =
	"ВЫБРАТЬ
	|	Заголовки.ИмяЗаголовка КАК ИмяЗаголовка,
	|	Заголовки.Значение КАК Значение
	|ИЗ
	|	Справочник.МС_НастройкиПодключений.Заголовки КАК Заголовки
	|ГДЕ
	|	Заголовки.Ссылка = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	Заголовки.НомерСтроки";
	ЗапросЗаголовки.УстановитьПараметр("Ссылка", НастройкаПодключенияСсылка);
	ВыборкаЗаголовков = ЗапросЗаголовки.Выполнить().Выбрать();
	Пока ВыборкаЗаголовков.Следующий() Цикл
		СтрокаЗаголовка = Новый Структура("ИмяЗаголовка, Значение",
			ВыборкаЗаголовков.ИмяЗаголовка, ВыборкаЗаголовков.Значение);
		Заголовки.Добавить(СтрокаЗаголовка);
	КонецЦикла;
	Настройка.Вставить("Заголовки", Заголовки);

	УстановитьПривилегированныйРежим(Истина);
	КлючХранилища = Строка(НастройкаПодключенияСсылка.УникальныйИдентификатор());
	Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(КлючХранилища, "Пароль");
	ПроксиПароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(КлючХранилища, "ПроксиПароль");
	Настройка.Вставить("Пароль", Пароль);
	Настройка.Вставить("ПроксиПароль", ПроксиПароль);
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Настройка;    	

КонецФункции

// Создает HTTP-соединение по параметрам настройки.
//
// Параметры:
//   Настройка - см. ПрочитатьНастройкуПодключения.
//
// Возвращаемое значение:
//   Структура - см. НовоеСоединение.
//
Функция НовоеСоединениеHTTP(Настройка)

	Результат = НовоеСоединение();

	Попытка
		СтруктураАдреса = РазобратьАдресHTTP(Настройка.Сервер, Настройка.ИспользоватьSSL, Настройка.Порт);
		Прокси = НовыйПрокси(Настройка);
		ЗащищенноеСоединение = ?(СтруктураАдреса.ИспользоватьSSL, Истина, Ложь);
		Таймаут = ?(ЗначениеЗаполнено(Настройка.Таймаут), Настройка.Таймаут, 0);

		Соединение = Новый HTTPСоединение(
			СтруктураАдреса.Сервер, СтруктураАдреса.Порт,
			Настройка.Пользователь, Настройка.Пароль,
			Прокси, Таймаут, ЗащищенноеСоединение);

		Результат.Соединение = Соединение;

		БазовыйПуть = ПутьИзАдресаHTTP(Настройка.Сервер);
		Пока СтрЗаканчиваетсяНа(БазовыйПуть, "/") Цикл
			БазовыйПуть = Лев(БазовыйПуть, СтрДлина(БазовыйПуть) - 1);
		КонецЦикла;
		Результат.БазовыйПуть = БазовыйПуть;

		Для Каждого СтрокаЗаголовка Из Настройка.Заголовки Цикл
			Если ЗначениеЗаполнено(СтрокаЗаголовка.ИмяЗаголовка) Тогда
				Результат.Заголовки.Вставить(СтрокаЗаголовка.ИмяЗаголовка, СтрокаЗаголовка.Значение);
			КонецЕсли;
		КонецЦикла;

	Исключение
		Результат.СтрокаОшибок = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	Возврат Результат;

КонецФункции

// Создает FTP-соединение по параметрам настройки.
//
// Параметры:
//   Настройка - см. ПрочитатьНастройкуПодключения.
//
// Возвращаемое значение:
//   Структура - см. НовоеСоединение.
//
Функция НовоеСоединениеFTP(Настройка)

	Результат = НовоеСоединение();

	Попытка
		Сервер = ОчиститьСхемуИзАдреса(Настройка.Сервер);
		Порт = ?(ЗначениеЗаполнено(Настройка.Порт), Настройка.Порт, 21);
		Прокси = НовыйПрокси(Настройка);
		ПассивныйРежим = Настройка.ПассивныйРежим;
		Таймаут = ?(ЗначениеЗаполнено(Настройка.Таймаут), Настройка.Таймаут, 0);
		ЗащищенноеСоединение = ?(Настройка.ИспользоватьSSL, Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено), Неопределено);

		Результат.Соединение = Новый FTPСоединение(Сервер, 
			Порт,           		
			Настройка.Пользователь, 
			Настройка.Пароль,
			Прокси, 
			ПассивныйРежим, 
			Таймаут, 
			ЗащищенноеСоединение,
			УровеньЗащищенногоСоединенияFTP(Настройка.УровеньЗащищенногоСоединенияFTP));
		Результат.ОсновнойКаталогFTP = НормализованныйКаталогFTP(Настройка.ОсновнойКаталогFTP);

	Исключение
		Результат.СтрокаОшибок = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	Возврат Результат;

КонецФункции

// Устаревший путь: вычисляет СтрокаПодключения и выполняет КодПодключения.
// Оставлен для обратной совместимости с ранее заведенными настройками, где
// ВидПодключения не заполнен или равен ПроизвольноеПодключение.
//
// Параметры:
//   Настройка - см. ПрочитатьНастройкуПодключения.
//
// Возвращаемое значение:
//   Структура - см. НовоеСоединение.
//
Функция ПолучитьСоединениеПроизвольное(Настройка)

	Результат = НовоеСоединение();

	Попытка
		//BSLLS:UnusedLocalVariable-off
		СтрокаПодключения = Вычислить(Настройка.СтрокаПодключения); // Используется через Выполнить ниже.
		Соединение = Неопределено; // Заполняется в КодПодключения.
		//BSLLS:UnusedLocalVariable-on
		Выполнить(Настройка.КодПодключения);
		Выполнить("Результат.Соединение = Соединение;");
	Исключение
		Результат.СтрокаОшибок = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	Возврат Результат;

КонецФункции

// Разбирает адрес HTTP-сервера на сервер, порт и признак SSL.
// Принимает как чистое имя хоста, так и полный URL (http:// или https://).
//
// Параметры:
//   Адрес - Строка - значение реквизита Сервер.
//   ИспользоватьSSLНастройка - Булево - значение реквизита ИспользоватьSSL.
//   ПортНастройка - Число - значение реквизита Порт.
//
// Возвращаемое значение:
//   Структура:
//     * Сервер - Строка - имя хоста без схемы и порта.
//     * Порт - Число - явный или подставленный по умолчанию (80/443).
//     * ИспользоватьSSL - Булево - результирующее решение по SSL.
//
Функция РазобратьАдресHTTP(Адрес, ИспользоватьSSLНастройка, ПортНастройка)

	ИспользоватьSSL = ИспользоватьSSLНастройка;
	Сервер = СокрЛП(Адрес);

	Если СтрНачинаетсяС(НРег(Сервер), "https://") Тогда
		Сервер = Сред(Сервер, 9);
		ИспользоватьSSL = Истина;
	ИначеЕсли СтрНачинаетсяС(НРег(Сервер), "http://") Тогда
		Сервер = Сред(Сервер, 8);
	КонецЕсли;

	ПозицияСлеша = СтрНайти(Сервер, "/");
	Если ПозицияСлеша > 0 Тогда
		Сервер = Лев(Сервер, ПозицияСлеша - 1);
	КонецЕсли;

	Порт = ПортНастройка;
	ПозицияДвоеточия = СтрНайти(Сервер, ":");
	Если ПозицияДвоеточия > 0 Тогда
		ПортИзАдреса = Сред(Сервер, ПозицияДвоеточия + 1);
		Сервер = Лев(Сервер, ПозицияДвоеточия - 1);
		Если ЗначениеЗаполнено(ПортИзАдреса) Тогда
			//BSLLS:MissingCodeTryCatchEx-off
			Попытка
				Порт = Число(ПортИзАдреса);
			Исключение
				// Оставляем Порт как в настройке - строка в адресе оказалась не числом.
			КонецПопытки;
			//BSLLS:MissingCodeTryCatchEx-on
		КонецЕсли;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Порт) Тогда
		Порт = ?(ИспользоватьSSL, 443, 80);
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("Сервер", Сервер);
	Результат.Вставить("Порт", Порт);
	Результат.Вставить("ИспользоватьSSL", ИспользоватьSSL);
	Возврат Результат;

КонецФункции

// Отсекает http:// / https:// / ftp:// из начала адреса (для видов, где схема не нужна).
Функция ОчиститьСхемуИзАдреса(Адрес)

	Значение = СокрЛП(Адрес);
	Для Каждого Схема Из СтрРазделить("http://,https://,ftp://,ftps://", ",") Цикл
		Если СтрНачинаетсяС(НРег(Значение), Схема) Тогда
			Значение = Сред(Значение, СтрДлина(Схема) + 1);
		КонецЕсли;
	КонецЦикла;
	Возврат Значение;

КонецФункции

// Уровень использования защищенного соединения FTP по значению реквизита настройки подключения.
// Пустое значение - ТребоватьДляУправления, как было до появления реквизита.
//
// Параметры:
//   ИмяУровня - Строка - значение реквизита УровеньЗащищенногоСоединенияFTP: имя значения
//                        системного перечисления УровеньИспользованияЗащищенногоСоединенияFTP.
//
// Возвращаемое значение:
//   УровеньИспользованияЗащищенногоСоединенияFTP
//
Функция УровеньЗащищенногоСоединенияFTP(ИмяУровня)
	Имя = СокрЛП(ИмяУровня);
	Если Имя = "Авто" Тогда
		Возврат УровеньИспользованияЗащищенногоСоединенияFTP.Авто;
	ИначеЕсли Имя = "ИспользоватьЕслиВозможно" Тогда
		Возврат УровеньИспользованияЗащищенногоСоединенияFTP.ИспользоватьЕслиВозможно;
	ИначеЕсли Имя = "НеИспользовать" Тогда
		Возврат УровеньИспользованияЗащищенногоСоединенияFTP.НеИспользовать;
	ИначеЕсли Имя = "Требовать" Тогда
		Возврат УровеньИспользованияЗащищенногоСоединенияFTP.Требовать;
	Иначе
		Возврат УровеньИспользованияЗащищенногоСоединенияFTP.ТребоватьДляУправления;
	КонецЕсли;
КонецФункции

// Создает ИнтернетПрокси по параметрам настройки, либо Неопределено, если прокси не используется.
//
// Параметры:
//   Настройка - см. ПрочитатьНастройкуПодключения.
//
// Возвращаемое значение:
//   ИнтернетПрокси, Неопределено
//
Функция НовыйПрокси(Настройка)

	Если Не Настройка.ИспользоватьПрокси Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Настройка.ПроксиСервер) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Прокси = Новый ИнтернетПрокси(Ложь);
	Порт = ?(ЗначениеЗаполнено(Настройка.ПроксиПорт), Настройка.ПроксиПорт, 8080);
	Прокси.Установить("http", Настройка.ПроксиСервер, Порт, Настройка.ПроксиПользователь, Настройка.ПроксиПароль);
	Прокси.Установить("https", Настройка.ПроксиСервер, Порт, Настройка.ПроксиПользователь, Настройка.ПроксиПароль);
	Прокси.Установить("ftp", Настройка.ПроксиСервер, Порт, Настройка.ПроксиПользователь, Настройка.ПроксиПароль);
	Возврат Прокси;

КонецФункции

#КонецОбласти

#КонецЕсли
